# 데이터프레임 그룹분석

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

## pivot method

In [3]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [4]:
# pivot(행 인덱스, 열 인덱스, 보여줄 데이터)
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

## 매우 중요한 그룹 분석

* 만약 키가 지정하는 조건에 맞는 데이터가 하나 이상이라서 데이터 그룹을 이루는 경우에는 그룹의 특성을 보여주는 그룹분석(group analysis)을 해야 한다.

* 그룹분석은 피봇테이블과 달리 키에 의해서 결정되는 데이터가 여러개가 있을 경우 미리 지정한 연산을 통해 그 그룹 데이터의 대표값을 계산한다. 판다스에서는 groupby 메서드를 사용하여 다음처럼 그룹분석을 한다.

* 분석하고자 하는 시리즈나 데이터프레임에 groupby 메서드를 호출하여 그룹화를 한다. 그룹 객체에 대해 그룹연산을 수행한다.
* group by
* 그룹연산 메서드

* groupby 결과, 즉 GroupBy 클래스 객체의 뒤에 붙일 수 있는 그룹연산 메서드는 다양하다. 다음은 자주 사용되는 그룹연산 메서드들이다.

  * size, count: 그룹 데이터의 갯수

  * mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대

  * sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수

  * first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터

* 이 외에도 많이 사용되는 것으로는 다음과 같은 그룹연산이 있다.

  * agg, aggregate

* 만약 원하는 그룹연산이 없는 경우 함수를 만들고 이 함수를 agg에 전달한다.

* 또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.

  * describe

* 하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.

  * apply

  * describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다.

  * transform

* 그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.

In [7]:
iris = sns.load_dataset('iris')
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [9]:
iris.groupby(iris.species).agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [10]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [11]:
df2.groupby(df2['key1']) # 반복문
df2.groupby(df2.key1).sum() # 평소

      data1  data2
key1
A         8     80
B         7     70

In [12]:
df2.groupby(df2.key1)['data2'].sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [13]:
df2.data2.groupby(df2.key1).sum()   #많이 사용!

key1
A    80
B    70
Name: data2, dtype: int64

## 내가 만든 함수를 적용하는 경우

* agg() 메서드
* apply()

In [14]:
def peak_to_peak_ratio(x):
  return x.max() / x.min()

In [15]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [16]:
# def 하나 lambda 하나 값은 똑같다!
iris.groupby(iris.species).agg(lambda x: x.max()/x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [17]:
#apply도 같은 값
iris.groupby(iris.species).apply(lambda x: x.max()/x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [18]:
# describe는 초기 데이터를 훑어볼때 사용
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [19]:
#품종별로 describe
iris.groupby(iris.species).describe()

           sepal_length                               ... petal_width
                  count   mean       std  min    25%  ...         min  25%  50%  75%  max
species                                               ...
setosa             50.0  5.006  0.352490  4.3  4.800  ...         0.1  0.2  0.2  0.3  0.6
versicolor         50.0  5.936  0.516171  4.9  5.600  ...         1.0  1.2  1.3  1.5  1.8
virginica          50.0  6.588  0.635880  4.9  6.225  ...         1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [20]:
iris.groupby(iris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [21]:
# miles per gallon
mpg = sns.load_dataset('mpg')
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [28]:
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])

In [27]:
mpg['model'] = mpg.name.apply(lambda x: ' '.join(x.split()[1:]))
mpg.head()

    mpg  cylinders  ...  manufacturer            model
0  18.0          8  ...     chevrolet  chevelle malibu
1  15.0          8  ...         buick      skylark 320
2  18.0          8  ...      plymouth        satellite
3  16.0          8  ...           amc        rebel sst
4  17.0          8  ...          ford           torino

[5 rows x 11 columns]

In [29]:
# transform qcut(3등분) 메서드는 그룹별 대표값을 만드는 것이 아니라 그룹별 계산을 통해
# 데이터프레임 자체를 변화시킨다. 따라서 만들어진 데이터프레임의 크기는 
#원래 데이터프레임과 같다.

def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)


iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
iris[["petal_length", "petal_length_class"]].tail(10)

     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

In [ ]:
#위와 같은 데이터프레임 보기 좋게 변경
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)


iris["petal_length_class"] = iris.groupby(iris.species)['petal_length']transform(q3cut)
iris[["petal_length", "petal_length_class"]].tail(10)

## pivot_table

pivot_table 명령은 groupby 명령처럼 그룹분석을 하지만 최종적으로는 pivot 명령처럼 피봇테이블을 만든다. 즉 groupby 명령의 결과에 unstack을 자동 적용하여 2차원적인 형태로 변형한다.

pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, margins_name='All')

* data: 분석할 데이터프레임 (메서드일 때는 필요하지 않음)

* values: 분석할 데이터프레임에서 분석할 열

* index: 행 인덱스로 들어갈 키 열 또는 키 열의 리스트

* columns: 열 인덱스로 들어갈 키 열 또는 키 열의 리스트

* aggfunc: 분석 메서드

* fill_value: NaN 대체 값

* margins: 모든 데이터를 분석한 결과를 오른쪽과 아래에 붙일지 여부

* margins_name: 마진 열(행)의 이름

만약 조건에 따른 데이터가 유일하게 선택되지 않으면 그룹연산을 하며 이 때 aggfunc 인수로 정의된 함수를 수행하여 대표값을 계산한다.
pivot_table를 메서드로 사용할 때는 객체 자체가 데이터가 되므로 data 인수가 필요하지 않다.

In [34]:
df1.pivot("인구", "도시", "연도")

도시         부산    서울    인천
인구
263203    NaN   NaN  2010
2890451   NaN   NaN  2015
3393191  2010   NaN   NaN
3448737  2015   NaN   NaN
3512547  2005   NaN   NaN
9631482   NaN  2010   NaN
9762546   NaN  2005   NaN
9904312   NaN  2015   NaN

In [33]:
df1.pivot_table('인구', '도시', '연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [35]:
df1.pivot_table("인구", "도시", "연도", margins=True, margins_name="합계")

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [36]:
df1.pivot_table('인구',['지역', '도시'], '연도', margins=True, margins_name='합계')

연도           2005       2010       2015            합계
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3.451492e+06
수도권 서울  9762546.0  9631482.0  9904312.0  9.766113e+06
    인천        NaN   263203.0  2890451.0  1.576827e+06
합계      6637546.5  4429292.0  5414500.0  5.350809e+06

## tips dataset 사례

In [38]:
tips = sns.load_dataset('tips')
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [42]:
tips['tip_pct'] = np.round(tips.tip / tips.total_bill * 100, 2)

In [43]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size  tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3    20.39
240       27.18  2.00  Female    Yes   Sat  Dinner     2     7.36
241       22.67  2.00    Male    Yes   Sat  Dinner     2     8.82
242       17.82  1.75    Male     No   Sat  Dinner     2     9.82
243       18.78  3.00  Female     No  Thur  Dinner     2    15.97

In [44]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672   16.079754
std      8.902412    1.383638    0.951100    6.107020
min      3.070000    1.000000    1.000000    3.560000
25%     13.347500    2.000000    2.000000   12.910000
50%     17.795000    2.900000    2.000000   15.475000
75%     24.127500    3.562500    3.000000   19.147500
max     50.810000   10.000000    6.000000   71.030000

In [45]:
tips.groupby(tips.sex).count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [46]:
tips.groupby('sex').count()  #위와 같은 결과

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [47]:
# Nan 데이터가 없을 떄 size()
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [48]:
# 성별, 흡연 여부에 따른 평균 팁 비율
tips.groupby('sex')[['tip_pct']].mean()

          tip_pct
sex
Male    15.764713
Female  16.648276

In [49]:
# 흡연 여부에 따른 평균 팁 비율
tips.groupby('smoker')[['tip_pct']].mean()

          tip_pct
smoker
Yes     16.319140
No      15.932318

In [51]:
# 성별과 흡연 여부에 따른 평균 팁 비율
tips.groupby(['sex', 'smoker'])[['tip_pct']].mean()

                 tip_pct
sex    smoker
Male   Yes     15.276667
       No      16.066598
Female Yes     18.214545
       No      15.691111

In [50]:
tips.groupby(['sex', 'smoker']).tip_pct.mean()  #시리즈로 나옴

sex     smoker
Male    Yes       15.276667
        No        16.066598
Female  Yes       18.214545
        No        15.691111
Name: tip_pct, dtype: float64

In [52]:
tips.pivot_table('tip_pct', ['sex', 'smoker'])

                 tip_pct
sex    smoker
Male   Yes     15.276667
       No      16.066598
Female Yes     18.214545
       No      15.691111

In [53]:
tips.pivot_table('tip_pct', 'sex', 'smoker')

smoker        Yes         No
sex
Male    15.276667  16.066598
Female  18.214545  15.691111

In [55]:
# 요일에 따른 팁의 비율
tips.groupby('day')[['tip_pct']].mean()

        tip_pct
day
Thur  16.126452
Fri   16.991579
Sat   15.314598
Sun   16.689605

In [56]:
# 점심/저녁 여부
tips.groupby('time')[['tip_pct']].mean()

          tip_pct
time
Lunch   16.411765
Dinner  15.951477

In [60]:
# 요일, 점심/저녁
tips.groupby(['day','time'])[['tip_pct']].mean()

               tip_pct
day  time
Thur Lunch   16.129016
     Dinner  15.970000
Fri  Lunch   18.875714
     Dinner  15.892500
Sat  Lunch         NaN
     Dinner  15.314598
Sun  Lunch         NaN
     Dinner  16.689605

In [61]:
tips.pivot_table('tip_pct', 'time', 'day')

day          Thur        Fri        Sat        Sun
time
Lunch   16.129016  18.875714        NaN        NaN
Dinner  15.970000  15.892500  15.314598  16.689605

In [62]:
# 요일, 시간, 인원수
tips.pivot_table('tip_pct', ['time', 'size'], 'day')

day               Thur        Fri        Sat        Sun
time   size
Lunch  1     18.170000  22.380000        NaN        NaN
       2     16.401277  18.196000        NaN        NaN
       3     14.460000  18.770000        NaN        NaN
       4     14.552000        NaN        NaN        NaN
       5     12.140000        NaN        NaN        NaN
       6     17.366667        NaN        NaN        NaN
Dinner 1           NaN        NaN  23.180000        NaN
       2     15.970000  16.267273  15.528679  18.086410
       3           NaN        NaN  15.142222  15.266000
       4           NaN  11.770000  13.828462  15.317222
       5           NaN        NaN  10.660000  15.986667
       6           NaN        NaN        NaN  10.380000

In [63]:
# 어떤 요인이 가장 크게 작용하는가?
tips.groupby(['day', 'time'])[['tip_pct']].agg(lambda x: x.max() / x.min())

               tip_pct
day  time
Thur Lunch    3.647945
     Dinner   1.000000
Fri  Lunch    2.203059
     Dinner   2.543436
Sat  Lunch         NaN
     Dinner   9.148876
Sun  Lunch         NaN
     Dinner  11.957912

In [67]:
tips.groupby(['sex', 'smoker'])[['tip_pct']].agg(lambda x: x.max() / x.min())

                 tip_pct
sex    smoker
Male   Yes     19.952247
       No       4.066852
Female Yes      7.388298
       No       4.448944

In [66]:
def peak2peak(x):
  return x.max() / x.min()
tips.groupby(['sex', 'smoker'])[['tip_pct']].agg(['mean', peak2peak])

                 tip_pct
                    mean  peak2peak
sex    smoker
Male   Yes     15.276667  19.952247
       No      16.066598   4.066852
Female Yes     18.214545   7.388298
       No      15.691111   4.448944

In [69]:
tips.groupby(['day', 'time'])[['tip_pct']].agg(['mean','std',peak2peak])

               tip_pct
                  mean       std  peak2peak
day  time
Thur Lunch   16.129016  3.896980   3.647945
     Dinner  15.970000       NaN   1.000000
Fri  Lunch   18.875714  4.588834   2.203059
     Dinner  15.892500  4.703129   2.543436
Sat  Lunch         NaN       NaN        NaN
     Dinner  15.314598  5.129187   9.148876
Sun  Lunch         NaN       NaN        NaN
     Dinner  16.689605  8.473462  11.957912